In [34]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [35]:
df= pd.read_csv('sample_data2.csv')

In [36]:
df.shape

(9, 5)

In [37]:
df.head()

   Serial Number               Title   Salary Qualification  Exp
0              1   Software Engineer  20000.0     Bachelors    3
1              2      Data Scientist  23000.0       Masters    4
2              3     Project Manager  18000.0       Masters    2
3              4           Professor  25000.0     Bachelors    5
4              5  Database Architect  17000.0     Bachelors    1

In [38]:
2/len(df)*100

22.22222222222222

In [39]:
### checking missing values
df.isnull().sum().sum()/len(df)*100

np.float64(22.22222222222222)

In [40]:
### df.dropna(inplace=True)-- use this function to drop rows, if missing values within 5%

In [41]:
df.isnull().sum()

Serial Number    0
Title            0
Salary           1
Qualification    1
Exp              0
dtype: int64

In [42]:
df.Salary.mean()

np.float64(18252.875)

In [43]:
df.Qualification.mode()

0    Bachelors
Name: Qualification, dtype: object

In [44]:
df.fillna({'Salary':df.Salary.mean(),'Qualification':df.Qualification.mode()[0]},inplace=True)

In [45]:
df.isnull().sum()

Serial Number    0
Title            0
Salary           0
Qualification    0
Exp              0
dtype: int64

In [46]:
#### Removing Duplicates
df.duplicated().sum()

np.int64(1)

In [47]:
df[df.duplicated()]

   Serial Number      Title   Salary Qualification  Exp
5              4  Professor  25000.0     Bachelors    5

In [50]:
df.drop_duplicates(inplace=True,ignore_index=True)

In [51]:
df

   Serial Number               Title     Salary Qualification  Exp
0              1   Software Engineer  20000.000     Bachelors    3
1              2      Data Scientist  23000.000       Masters    4
2              3     Project Manager  18000.000       Masters    2
3              4           Professor  25000.000     Bachelors    5
4              5  Database Architect  17000.000     Bachelors    1
5              7    Business Analyst  18000.000     Bachelors    5
6              8     UX/UI Developer     23.000     Bachelors    0
7              9     Devops Engineer  18252.875       Masters    2